; ModuleID = 'state_soa.llvm'
source_filename = "state_soa.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [12 x i8] c"output.data\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.2 = private unnamed_addr constant [34 x i8] c"Instance %2d: p_3=%.5f, p_4=%.5f\0A\00", align 1
@.str.3 = private constant [10 x i8] c"state_soa\00"
@.str.4 = private constant [4 x i8] c"9:0\00"
@.str.5 = private constant [5 x i8] c"p_16\00"
@.str.6 = private constant [1 x i8] zeroinitializer
@.str.7 = private constant [4 x i8] c"phi\00"
@.str.8 = private constant [4 x i8] c"p_6\00"
@.str.9 = private constant [4 x i8] c"p_7\00"
@.str.10 = private constant [4 x i8] c"p_3\00"
@.str.11 = private constant [5 x i8] c"p_12\00"
@.str.12 = private constant [5 x i8] c"p_13\00"
@.str.13 = private constant [5 x i8] c"p_10\00"
@.str.14 = private constant [5 x i8] c"p_11\00"
@.str.15 = private constant [4 x i8] c"p_4\00"
@.str.16 = private constant [2 x i8] c"i\00"
@.str.17 = private constant [4 x i8] c"v16\00"
@.str.18 = private constant [8 x i8] c"alpha_m\00"

!201 = !DILocation(line: 51, column: 32, scope: !191)
!202 = !DILocalVariable(name: "p_12", scope: !191, file: !1, line: 51, type: !4)
!203 = !DILocation(line: 51, column: 38, scope: !191)
!204 = !DILocalVariable(name: "p_13", scope: !191, file: !1, line: 51, type: !4)
!205 = !DILocation(line: 51, column: 45, scope: !191)
!206 = !DILocalVariable(name: "p_10", scope: !191, file: !1, line: 51, type: !4)
!207 = !DILocation(line: 51, column: 52, scope: !191)
!208 = !DILocalVariable(name: "p_11", scope: !191, file: !1, line: 51, type: !4)
!209 = !DILocation(line: 51, column: 60, scope: !191)
!210 = !DILocalVariable(name: "p_4", scope: !191, file: !1, line: 51, type: !4)
!211 = !DILocation(line: 51, column: 67, scope: !191)
!212 = !DILocation(line: 52, column: 23, scope: !191)
!213 = !DILocation(line: 52, column: 12, scope: !191)
!214 = !DILocation(line: 52, column: 10, scope: !191)
!215 = !DILocation(line: 53, column: 22, scope: !191)
!216 = !DILocation(line: 53, column: 11, scope: !191)
!217 = !DILocation(line: 53, column: 9, scope: !191)
!218 = !DILocation(line: 54, column: 22, scope: !191)
!219 = !DILocation(line: 54, column: 11, scope: !191)
!220 = !DILocation(line: 54, column: 9, scope: !191)
!221 = !DILocation(line: 55, column: 22, scope: !191)
!222 = !DILocation(line: 55, column: 11, scope: !191)
!223 = !DILocation(line: 55, column: 9, scope: !191)
!224 = !DILocation(line: 56, column: 23, scope: !191)
!225 = !DILocation(line: 56, column: 12, scope: !191)
!226 = !DILocation(line: 56, column: 10, scope: !191)
!227 = !DILocation(line: 57, column: 23, scope: !191)
!228 = !DILocation(line: 57, column: 12, scope: !191)
!229 = !DILocation(line: 57, column: 10, scope: !191)
!230 = !DILocation(line: 58, column: 23, scope: !191)
!231 = !DILocation(line: 58, column: 12, scope: !191)
!232 = !DILocation(line: 58, column: 10, scope: !191)
!233 = !DILocation(line: 59, column: 23, scope: !191)
!234 = !DILocation(line: 59, column: 12, scope: !191)
!235 = !DILocation(line: 59, column: 10, scope: !191)
!236 = !DILocation(line: 60, column: 22, scope: !191)
!237 = !DILocation(line: 60, column: 11, scope: !191)
!238 = !DILocation(line: 60, column: 9, scope: !191)
!239 = !DILocalVariable(name: "i", scope: !191, file: !1, line: 63, type: !33)
!240 = !DILocation(line: 63, column: 9, scope: !191)
!241 = !DILocation(line: 64, column: 12, scope: !242)
!242 = distinct !DILexicalBlock(scope: !191, file: !1, line: 64, column: 5)
!243 = !DILocation(line: 64, column: 10, scope: !242)
!244 = !DILocation(line: 64, column: 17, scope: !245)
!245 = distinct !DILexicalBlock(scope: !242, file: !1, line: 64, column: 5)
!246 = !DILocation(line: 64, column: 19, scope: !245)
!247 = !DILocation(line: 64, column: 5, scope: !242)
!248 = !DILocation(line: 65, column: 9, scope: !249)
!249 = distinct !DILexicalBlock(scope: !245, file: !1, line: 64, column: 41)
!250 = !DILocation(line: 65, column: 14, scope: !249)
!251 = !DILocation(line: 65, column: 17, scope: !249)
!252 = !DILocation(line: 66, column: 9, scope: !249)
!253 = !DILocation(line: 66, column: 13, scope: !249)
!254 = !DILocation(line: 66, column: 16, scope: !249)
!255 = !DILocation(line: 67, column: 9, scope: !249)
!256 = !DILocation(line: 67, column: 13, scope: !249)
!257 = !DILocation(line: 67, column: 16, scope: !249)
!258 = !DILocation(line: 68, column: 9, scope: !249)
!259 = !DILocation(line: 68, column: 13, scope: !249)
!260 = !DILocation(line: 68, column: 16, scope: !249)
!261 = !DILocation(line: 69, column: 9, scope: !249)
!262 = !DILocation(line: 69, column: 14, scope: !249)
!263 = !DILocation(line: 69, column: 17, scope: !249)
!264 = !DILocation(line: 70, column: 9, scope: !249)
!265 = !DILocation(line: 70, column: 14, scope: !249)
!266 = !DILocation(line: 70, column: 17, scope: !249)
!267 = !DILocation(line: 71, column: 9, scope: !249)
!268 = !DILocation(line: 71, column: 14, scope: !249)
!269 = !DILocation(line: 71, column: 17, scope: !249)
!270 = !DILocation(line: 72, column: 9, scope: !249)
!271 = !DILocation(line: 72, column: 14, scope: !249)
!272 = !DILocation(line: 72, column: 17, scope: !249)
!273 = !DILocation(line: 73, column: 9, scope: !249)
!274 = !DILocation(line: 73, column: 13, scope: !249)
!275 = !DILocation(line: 73, column: 16, scope: !249)
!276 = !DILocation(line: 75, column: 5, scope: !249)
!277 = !DILocation(line: 64, column: 37, scope: !245)
!278 = !DILocation(line: 64, column: 5, scope: !245)
!279 = distinct !{!279, !247, !280}
!280 = !DILocation(line: 75, column: 5, scope: !242)
!281 = !DILocation(line: 79, column: 16, scope: !191)
!282 = !DILocation(line: 79, column: 25, scope: !191)
!283 = !DILocation(line: 79, column: 33, scope: !191)
!284 = !DILocation(line: 79, column: 41, scope: !191)
!285 = !DILocation(line: 79, column: 49, scope: !191)
!286 = !DILocation(line: 79, column: 58, scope: !191)
!287 = !DILocation(line: 79, column: 67, scope: !191)
!288 = !DILocation(line: 79, column: 76, scope: !191)
!289 = !DILocation(line: 79, column: 85, scope: !191)
!290 = !DILocation(line: 79, column: 5, scope: !191)
!291 = !DILocalVariable(name: "output", scope: !191, file: !1, line: 83, type: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !294, line: 7, baseType: !295)
!294 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "/workspace/nrn-channel-kernel-test/simple-nrn-kernels")
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !296, line: 245, size: 1728, elements: !297)
!296 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "/workspace/nrn-channel-kernel-test/simple-nrn-kernels")
!297 = !{!298, !299, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !320, !321, !322, !323, !327, !329, !331, !335, !338, !340, !342, !343, !344, !345, !349, !350}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !295, file: !296, line: 246, baseType: !33, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !295, file: !296, line: 251, baseType: !300, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !295, file: !296, line: 252, baseType: !300, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !295, file: !296, line: 253, baseType: !300, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !295, file: !296, line: 254, baseType: !300, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !295, file: !296, line: 255, baseType: !300, size: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !295, file: !296, line: 256, baseType: !300, size: 64, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !295, file: !296, line: 257, baseType: !300, size: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !295, file: !296, line: 258, baseType: !300, size: 64, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !295, file: !296, line: 260, baseType: !300, size: 64, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !295, file: !296, line: 261, baseType: !300, size: 64, offset: 640)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !295, file: !296, line: 262, baseType: !300, size: 64, offset: 704)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !295, file: !296, line: 264, baseType: !313, size: 64, offset: 768)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !296, line: 160, size: 192, elements: !315)
!315 = !{!316, !317, !319}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !314, file: !296, line: 161, baseType: !313, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !314, file: !296, line: 162, baseType: !318, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !314, file: !296, line: 166, baseType: !33, size: 32, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !295, file: !296, line: 266, baseType: !318, size: 64, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !295, file: !296, line: 268, baseType: !33, size: 32, offset: 896)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !295, file: !296, line: 272, baseType: !33, size: 32, offset: 928)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !295, file: !296, line: 274, baseType: !324, size: 64, offset: 960)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !325, line: 140, baseType: !326)
!325 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/workspace/nrn-channel-kernel-test/simple-nrn-kernels")
!326 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !295, file: !296, line: 278, baseType: !328, size: 16, offset: 1024)
!328 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !295, file: !296, line: 279, baseType: !330, size: 8, offset: 1040)
!330 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !295, file: !296, line: 280, baseType: !332, size: 8, offset: 1048)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 8, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 1)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !295, file: !296, line: 284, baseType: !336, size: 64, offset: 1088)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !296, line: 154, baseType: null)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !295, file: !296, line: 293, baseType: !339, size: 64, offset: 1152)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !325, line: 141, baseType: !326)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !295, file: !296, line: 301, baseType: !341, size: 64, offset: 1216)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !295, file: !296, line: 302, baseType: !341, size: 64, offset: 1280)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !295, file: !296, line: 303, baseType: !341, size: 64, offset: 1344)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !295, file: !296, line: 304, baseType: !341, size: 64, offset: 1408)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !295, file: !296, line: 306, baseType: !346, size: 64, offset: 1472)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !347, line: 62, baseType: !348)
!347 = !DIFile(filename: "/usr/local/lib/clang/6.0.0/include/stddef.h", directory: "/workspace/nrn-channel-kernel-test/simple-nrn-kernels")
!348 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !295, file: !296, line: 307, baseType: !33, size: 32, offset: 1536)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !295, file: !296, line: 309, baseType: !351, size: 160, offset: 1568)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 160, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 20)
!354 = !DILocation(line: 83, column: 9, scope: !191)
!355 = !DILocation(line: 84, column: 12, scope: !191)
!356 = !DILocation(line: 84, column: 10, scope: !191)
!357 = !DILocation(line: 85, column: 10, scope: !358)
!358 = distinct !DILexicalBlock(scope: !191, file: !1, line: 85, column: 3)
!359 = !DILocation(line: 85, column: 8, scope: !358)
!360 = !DILocation(line: 85, column: 15, scope: !361)
!361 = distinct !DILexicalBlock(scope: !358, file: !1, line: 85, column: 3)
!362 = !DILocation(line: 85, column: 17, scope: !361)
!363 = !DILocation(line: 85, column: 3, scope: !358)
!364 = !DILocation(line: 86, column: 17, scope: !365)
!365 = distinct !DILexicalBlock(scope: !361, file: !1, line: 85, column: 39)
!366 = !DILocation(line: 86, column: 63, scope: !365)
!367 = !DILocation(line: 86, column: 66, scope: !365)
!368 = !DILocation(line: 86, column: 70, scope: !365)
!369 = !DILocation(line: 86, column: 74, scope: !365)
!370 = !DILocation(line: 86, column: 78, scope: !365)
!371 = !DILocation(line: 86, column: 9, scope: !365)
!372 = !DILocation(line: 87, column: 3, scope: !365)
!373 = !DILocation(line: 85, column: 35, scope: !361)
!374 = !DILocation(line: 85, column: 3, scope: !361)
!375 = distinct !{!375, !363, !376}
!376 = !DILocation(line: 87, column: 3, scope: !358)
!377 = !DILocation(line: 88, column: 3, scope: !191)
